app/Http/Controllers/Auth/RegisterController.php

    public function store(Request $request){
        // $request->get('email') OR $request->email;
        $this->validate($request,[
            'name' => 'required|max:255',
            'username' => 'required|max:255',
            'email' => 'required|email|max:255',
            'password' => 'required|confirmed',
        ]);
        User::create([
            'name' => $request->name,
            'username' => $request->username,
            'email' => $request->email,
            'password' => Hash::make($request->password),
        ]);
---
insert into `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) values ('Nil Rajp', 'Nilrajp1318', 'Nilrajp1318@gmail.com', '$2y$10$Mb4gM1TAFEbbVvuZRPgvgeN8.1TXmy02YzkEpP64FEJDv/QAWEN1.', '2022-05-12 13:28:02', '2022-05-12 13:28:02')