app/Http/Controllers/PostLikeController.php

    public function store(Post $post,Request $request){
        if($post->likedBy($request->user())){
            return response(null,409);
        }
        $post->likes()->create([
            'user_id' => $request->user()->id,
        ]);
---
insert into `likes` (`user_id`, `post_id`, `updated_at`, `created_at`) values (1, 291, '2022-05-12 14:36:16', '2022-05-12 14:36:16')

    public function destory(Post $post,Request $request){
        $request->user()->likes()->where('post_id',$post->id)->delete();
---
delete from `likes` where `likes`.`user_id` = 1 and `likes`.`user_id` is not null and `post_id` = 4
update `likes` set `deleted_at` = '2022-05-12 15:02:00', `likes`.`updated_at` = '2022-05-12 15:02:00' where `likes`.`user_id` = 1 and `likes`.`user_id` is not null and `post_id` = 292 and `likes`.`deleted_at` is null