app/Http/Controllers/PostController.php

    public function index(){
        //Egale load with laravel-debugbar
        // $posts = Post::orderBy('created_at','desc')->with(['user','likes'])->paginate(10);
        $posts = Post::latest('created_at','desc')->with(['user','likes'])->paginate(10);
---
select * from `likes` where `likes`.`post_id` in (276, 277, 284, 285, 286, 287, 288, 289, 292, 294) and `likes`.`deleted_at` is null
select * from `posts` order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in (1, 2)
select count(*) as aggregate from `posts`

    public function store(Request $request){
        $this->validate($request,[
            'body'=>'required'
        ]);
        $request->user()->posts()->create($request->only('body'));
---
insert into `posts` (`body`, `user_id`, `updated_at`, `created_at`) values ('Posted', 1, '2022-05-12 15:08:34', '2022-05-12 15:08:34')

    public function destroy(Post $post,Request $request){
        // if(!$post->ownedBy(auth()->user())){
        //     dd('no');
        // } OR

        $this->authorize('delete',$post);
        $post->delete();
---
delete from `posts` where `id` = 293