app/Http/Controllers/UserPostController.php

select * from `likes` where `likes`.`post_id` in (292)
select * from `posts` where `posts`.`user_id` = 2 and `posts`.`user_id` is not null order by `created_at` desc limit 20 offset 0
select * from `users` where `users`.`id` in (2)
select count(*) as aggregate from `posts` where `posts`.`user_id` = 2 and `posts`.`user_id` is not null
---
    public function index(User $user){
        $posts = $user->posts()->latest()->with(['user','likes'])->paginate(20);